#### Terraform Format and Style 🖌
#### Environment  (CI)
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_api_key.platform-manager-kafka-api-key will be created
  + resource "confluent_api_key" "platform-manager-kafka-api-key" {
      + description            = "Kafka API Key that is owned by 'platform-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "platform-manager-kafka-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = (known after apply)
            }
        }

      + owner {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)
        }
    }

  # confluent_environment.env will be created
  + resource "confluent_environment" "env" {
      + display_name  = "unnamed"
      + id            = (known after apply)
      + resource_name = (known after apply)
    }

  # confluent_kafka_cluster.standard will be created
  + resource "confluent_kafka_cluster" "standard" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AWS"
      + display_name       = "standard_kafka_cluster"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "us-west-2"
      + rest_endpoint      = (known after apply)

      + byok_key {
          + id = (known after apply)
        }

      + environment {
          + id = (known after apply)
        }

      + network {
          + id = (known after apply)
        }

      + standard {}
    }

  # confluent_role_binding.platform-manager-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "platform-manager-kafka-cluster-admin" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "CloudClusterAdmin"
    }

  # confluent_service_account.platform-manager will be created
  + resource "confluent_service_account" "platform-manager" {
      + api_version  = (known after apply)
      + description  = "Service account to manage the platform"
      + display_name = "platform-manager-unnamed"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```

</details>
*Pushed by: @kirkmcpherson, Action: `pull_request`*